# Определите, при каком наименьшем введённом значении переменной s программа выведет число 23
for i in range(0, 10000):
    s = i
    n = 50
    while s > 0:
        s = s // 2
        n = n - 3
    if n == 23:
        print(i)
        break